export default [
  {
    name: "欢迎来到实验室!",
    map: [
      "******",
      "*^ # *",
      "******",
    ],
    sample: "FORWARD 3",
    description:
    "欢迎来到实验室！最近计算科学实验室遇到了一个大难题：实验室首席技术杠把子霸气帅哥在清华附中的复杂实验楼中迷路了！\n" +
    "虽然霸气帅哥不记得逃离实验楼的路径了，但是所幸他在实验楼的走动过程中留下了一些标记。只可惜他是星际玩家，并不能看到一米以外的物体。但是你视力是正常的，所以霸气帅哥需要你的帮助。\n" +
    "霸气帅哥可能写程序写傻了，能理解的人的语言也接近了编程语言。在你屏幕左侧的编辑器中是霸气帅哥能看懂的语言的示例，你可以通过这种语言与霸气帅哥沟通。\n" +
    "\n" +
    "例如：\n" +
    "WALK 步数\n" +
    "\n" +
    "这一行指令会让霸气帅哥向前走一定步数\n" +
    "\n" +
    "霸气帅哥会不断重复执行指令直到在某行指令执行结束后他正好站在出口上。\n" +
    "屏幕右侧上方显示的是实验楼地图，下方是友善的并没有把霸气帅哥带丢的实验楼广播员的友情提示。在你修改给霸气帅哥的指示后，你可以点击屏幕右下角的按钮让霸气帅哥执行你的指令，执行结果在地图上会有所显示。\n" +
    "点击执行按钮让霸气帅哥执行当前的命令，并作出一定修改让霸气帅哥能抵达地图上的出口。霸气帅哥能不能吃到今天的晚饭，就靠你了！\n",
  },
  {
    name: "这有点困难",
    map: [
      "********",
      "*^     *",
      "****** *",
      "     * *",
      "     *#*",
      "     ***",
    ],
  }
];
